export const districtsData: Record<string, string[]> = {
  "ಬೆಂಗಳೂರು ಉತ್ತರ": ["ಹೋರಮಾವು", "ಅಕ್ಷಯ್ ನಗರ", "ಹಲಸೂರು", "ಯಲಹಂಕ", "ಮಹಾಲಕ್ಷ್ಮೀಪುರ"]
  // "ಬೆಂಗಳೂರು ದಕ್ಷಿಣ": ["ಬನಶಂಕರಿ", "ಜೆಪಿ ನಗರ", "ಜಯನಗರ"],
  // "ಮಂಗಳೂರು": ["ಮಂಗಳೂರು ದಕ್ಷಿಣ", "ಮಂಗಳೂರು ಉತ್ತರ", "ಪಣಂಬೂರು"],
  // "ಹಾಸನ": ["ಅಲೂರು", "ಚನ್ನರಾಯಪಟ್ಟಣ", "ಬೆಲೂರು"],
  // "ಮೈಸೂರು": ["ನಂಜನಗೂಡು", "ಹುಣಸೂರು", "ಹಡಸೂರು"],
  // "ಕೋಲಾರ": ["ಮಳೂರು", "ಕೆಜಿಎಫ್", "ಬಂಗಾರಪೇಟೆ"]
};

export const vibhagData: Record<string, string[]> = {
  "ಹೋರಮಾವು": ["ಹೆನ್ನೂರು", "ಹೋರಮಾವು", "ರಾಮಮೂರ್ತಿ ನಗರ"],
  "ಅಕ್ಷಯ್ ನಗರ": ["ಅಕ್ಷಯ್ ನಗರ", "ಕಲ್ಕೇರೆ", "ಕೆ.ಆರ್.ಪುರಂ", "ಬೊಮ್ಮನಹಳ್ಳಿ"],
  "ಹಲಸೂರು": ["ಟಿಪ್ಪಸಂದ್ರ", "ವಿಮಾನಪುರ", "ಕಸ್ತೂರಿನಗರ"],
  "ಯಲಹಂಕ": ["ಅಮೃತ್ ನಗರ", "ಕೋಗಿಲು", "ಸಹಕಾರ ನಗರ", "ಟೆಲಿಕಾಂ ಲೇಔಟ್", "ವಿದ್ಯಾರಣ್ಯಪುರ", "ಯಲಹಂಕ"],
  "ಮಹಾಲಕ್ಷ್ಮೀಪುರ": ["ಮಲ್ಲೇಶ್ವರಂ", "ದಾಸರಹಳ್ಳಿ", "ಬಸವೇಶ್ವರನಗರ", "ಹೆಬ್ಬಾಳ"]
};
